InformationRegisters/ДатыПоследнихЗагрузокВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДатыПоследнихЗагрузокВСД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеПрерывания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПрервана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВСД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыВСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыПоследнихЗагрузокВСД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

// Монопольный обработчик обновления 2.0.6.1
Процедура ЗаполнитьТипыЗагружаемыхВСД() Экспорт
	
	МассивТиповВСД = Новый Массив;
	МассивТиповВСД.Добавить(Справочники.ТипыВСД.Транспортный);
	МассивТиповВСД.Добавить(Справочники.ТипыВСД.ПроизводственныйВСД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыПоследнихЗагрузокВСД.Организация КАК Организация,
		|	ДатыПоследнихЗагрузокВСД.Предприятие КАК Предприятие,
		|	МИНИМУМ(ДатыПоследнихЗагрузокВСД.Дата) КАК Дата
		|ИЗ
		|	РегистрСведений.ДатыПоследнихЗагрузокВСД КАК ДатыПоследнихЗагрузокВСД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатыПоследнихЗагрузокВСД.Предприятие,
		|	ДатыПоследнихЗагрузокВСД.Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ДатыПоследнихЗагрузокВСД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.Предприятие.Установить(Выборка.Предприятие);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Для Каждого ТипВСД Из МассивТиповВСД Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ТипВСД = ТипВСД;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "ДатыПоследнихЗагрузокВСД", Загрузка);
	
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "ДатыПоследнихЗагрузокВСД", Загрузка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
